In [1]:
from config import api_key
import quandl
import pandas as pd

In [2]:
# Obtaining a list of all the countries and their associated three letter codes
countries = pd.read_html('https://countrycode.org/')

In [3]:
# Viewing the Dataframe
countries

[               COUNTRY COUNTRY CODE ISO CODES  POPULATION  AREA KM2  \
 0          Afghanistan           93  AF / AFG    29121286    647500
 1              Albania          355  AL / ALB     2986952     28748
 2              Algeria          213  DZ / DZA    34586184   2381740
 3       American Samoa        1-684  AS / ASM       57881       199
 4              Andorra          376  AD / AND       84000       468
 ..                 ...          ...       ...         ...       ...
 235  Wallis and Futuna          681  WF / WLF       16025       274
 236     Western Sahara          212  EH / ESH      273008    266000
 237              Yemen          967  YE / YEM    23495361    527970
 238             Zambia          260  ZM / ZMB    13460305    752614
 239           Zimbabwe          263  ZW / ZWE    11651858    390580

           GDP $USD
 0    20.65 Billion
 1     12.8 Billion
 2    215.7 Billion
 3    462.2 Million
 4      4.8 Billion
 ..             ...
 235            NaN
 236            NaN
 237  43.89 Billion
 238  22.24 Billion
 239  10.48 Billion

 [240 rows x 6 columns],
                COUNTRY COUNTRY CODE ISO CODES
 0          Afghanistan           93  AF / AFG
 1              Albania          355  AL / ALB
 2              Algeria          213  DZ / DZA
 3       American Samoa        1-684  AS / ASM
 4              Andorra          376  AD / AND
 ..                 ...          ...       ...
 235  Wallis and Futuna          681  WF / WLF
 236     Western Sahara          212  EH / ESH
 237              Yemen          967  YE / YEM
 238             Zambia          260  ZM / ZMB
 239           Zimbabwe          263  ZW / ZWE

 [240 rows x 3 columns]]

In [4]:
# Determing the type for the country variable
type(countries)

list

In [5]:
# Obtain the first key of the list
countries_list = countries[0]
countries_list

,COUNTRY,COUNTRY CODE,ISO CODES,POPULATION,AREA KM2,GDP $USD
0,Afghanistan,93,AF / AFG,29121286,647500,20.65 Billion
1,Albania,355,AL / ALB,2986952,28748,12.8 Billion
2,Algeria,213,DZ / DZA,34586184,2381740,215.7 Billion
3,American Samoa,1-684,AS / ASM,57881,199,462.2 Million
4,Andorra,376,AD / AND,84000,468,4.8 Billion
...,...,...,...,...,...,...
235,Wallis and Futuna,681,WF / WLF,16025,274,NaN
236,Western Sahara,212,EH / ESH,273008,266000,NaN
237,Yemen,967,YE / YEM,23495361,527970,43.89 Billion
238,Zambia,260,ZM / ZMB,13460305,752614,22.24 Billion
239,Zimbabwe,263,ZW / ZWE,11651858,390580,10.48 Billion

In [6]:
# Splitting the column relating to ISO CODES
iso_code_split = countries_list['ISO CODES'].str.split("/",n=1, expand=True)
iso_code_split

       0     1
0    AF    AFG
1    AL    ALB
2    DZ    DZA
3    AS    ASM
4    AD    AND
..   ...   ...
235  WF    WLF
236  EH    ESH
237  YE    YEM
238  ZM    ZMB
239  ZW    ZWE

[240 rows x 2 columns]

In [7]:
# Adding the split list back to the dataframe
countries_list['ISO CODE 2L'] = iso_code_split[0]
countries_list

,COUNTRY,COUNTRY CODE,ISO CODES,POPULATION,AREA KM2,GDP $USD,ISO CODE 2L
0,Afghanistan,93,AF / AFG,29121286,647500,20.65 Billion,AF
1,Albania,355,AL / ALB,2986952,28748,12.8 Billion,AL
2,Algeria,213,DZ / DZA,34586184,2381740,215.7 Billion,DZ
3,American Samoa,1-684,AS / ASM,57881,199,462.2 Million,AS
4,Andorra,376,AD / AND,84000,468,4.8 Billion,AD
...,...,...,...,...,...,...,...
235,Wallis and Futuna,681,WF / WLF,16025,274,NaN,WF
236,Western Sahara,212,EH / ESH,273008,266000,NaN,EH
237,Yemen,967,YE / YEM,23495361,527970,43.89 Billion,YE
238,Zambia,260,ZM / ZMB,13460305,752614,22.24 Billion,ZM
239,Zimbabwe,263,ZW / ZWE,11651858,390580,10.48 Billion,ZW

In [8]:
# Adding the second three letter code list back to the original dataframe
countries_list['ISO CODE 3L'] = iso_code_split[1]
countries_list

,COUNTRY,COUNTRY CODE,ISO CODES,POPULATION,AREA KM2,GDP $USD,ISO CODE 2L,ISO CODE 3L
0,Afghanistan,93,AF / AFG,29121286,647500,20.65 Billion,AF,AFG
1,Albania,355,AL / ALB,2986952,28748,12.8 Billion,AL,ALB
2,Algeria,213,DZ / DZA,34586184,2381740,215.7 Billion,DZ,DZA
3,American Samoa,1-684,AS / ASM,57881,199,462.2 Million,AS,ASM
4,Andorra,376,AD / AND,84000,468,4.8 Billion,AD,AND
...,...,...,...,...,...,...,...,...
235,Wallis and Futuna,681,WF / WLF,16025,274,NaN,WF,WLF
236,Western Sahara,212,EH / ESH,273008,266000,NaN,EH,ESH
237,Yemen,967,YE / YEM,23495361,527970,43.89 Billion,YE,YEM
238,Zambia,260,ZM / ZMB,13460305,752614,22.24 Billion,ZM,ZMB
239,Zimbabwe,263,ZW / ZWE,11651858,390580,10.48 Billion,ZW,ZWE

In [9]:
# Creating a list of countries to iterate
list_of_countries = countries_list['COUNTRY'].tolist()
list_of_countries[:5]

['Afghanistan', 'Albania', 'Algeria', 'American Samoa', 'Andorra']

In [10]:
# Creating a list of the ISO codes to iterate over
_2l_ISO_CODES = countries_list['ISO CODE 2L'].tolist()
_2l_ISO_CODES[:5]

['AF ', 'AL ', 'DZ ', 'AS ', 'AD ']

In [11]:
# Removing the spaces within the list
_2l_ISO_CODES = [x.strip(' ') for x in _2l_ISO_CODES]
_2l_ISO_CODES[:5]

['AF', 'AL', 'DZ', 'AS', 'AD']

In [12]:
# Creating a list of the three letter ISO CODES to iterate over
_3l_ISO_CODES = countries_list['ISO CODE 3L'].tolist()
_3l_ISO_CODES[:5]

[' AFG', ' ALB', ' DZA', ' ASM', ' AND']

In [13]:
# Removing spaces within the list
_3l_ISO_CODES = [x.strip(' ') for x in _3l_ISO_CODES]
_3l_ISO_CODES[:5]

['AFG', 'ALB', 'DZA', 'ASM', 'AND']

# Extraction, Transformation and Loading from QUANDL Database

In [14]:
# Accessing the Database with the API Key
quandl.ApiConfig.api_key = api_key

In [15]:
# Iterating over the list to obtain data 
quandl.get_table('WB/DATA', series_id='VC.PKP.TOTL.UN', country_code='XKX,TLS,SYR')

           series_id country_code          country_name  year   value
None
0     VC.PKP.TOTL.UN          XKX                Kosovo  2017    17.0
1     VC.PKP.TOTL.UN          XKX                Kosovo  2016    14.0
2     VC.PKP.TOTL.UN          XKX                Kosovo  2015    16.0
3     VC.PKP.TOTL.UN          XKX                Kosovo  2014    16.0
4     VC.PKP.TOTL.UN          XKX                Kosovo  2013    14.0
5     VC.PKP.TOTL.UN          XKX                Kosovo  2012    16.0
6     VC.PKP.TOTL.UN          XKX                Kosovo  2011    16.0
7     VC.PKP.TOTL.UN          XKX                Kosovo  2010    16.0
8     VC.PKP.TOTL.UN          XKX                Kosovo  2009    17.0
9     VC.PKP.TOTL.UN          TLS           Timor-Leste  2011  1216.0
10    VC.PKP.TOTL.UN          TLS           Timor-Leste  2010  1517.0
11    VC.PKP.TOTL.UN          TLS           Timor-Leste  2009  1552.0
12    VC.PKP.TOTL.UN          SYR  Syrian Arab Republic  2017   985.0
13    VC.PKP.TOTL.UN          SYR  Syrian Arab Republic  2016   829.0
14    VC.PKP.TOTL.UN          SYR  Syrian Arab Republic  2015   793.0
15    VC.PKP.TOTL.UN          SYR  Syrian Arab Republic  2014   930.0

In [22]:
# Extracting the Realestate Data for all the countries
real_estate_df = quandl.get_table('WB/DATA', series_id='VC.PKP.TOTL.UN', country_code=_3l_ISO_CODES)

In [23]:
type(real_estate_df)

pandas.core.frame.DataFrame

In [24]:
# Viewing the Real Estate Data Frame
real_estate_df

           series_id country_code country_name  year  value
None
0     VC.PKP.TOTL.UN          XKX       Kosovo  2017   17.0
1     VC.PKP.TOTL.UN          XKX       Kosovo  2016   14.0
2     VC.PKP.TOTL.UN          XKX       Kosovo  2015   16.0
3     VC.PKP.TOTL.UN          XKX       Kosovo  2014   16.0
4     VC.PKP.TOTL.UN          XKX       Kosovo  2013   14.0
...              ...          ...          ...   ...    ...
121   VC.PKP.TOTL.UN          AFG  Afghanistan  2013   25.0
122   VC.PKP.TOTL.UN          AFG  Afghanistan  2012   23.0
123   VC.PKP.TOTL.UN          AFG  Afghanistan  2011   15.0
124   VC.PKP.TOTL.UN          AFG  Afghanistan  2010   16.0
125   VC.PKP.TOTL.UN          AFG  Afghanistan  2009   20.0

[126 rows x 5 columns]

In [25]:
# Exporting the dataframe
real_estate_df.to_csv('cleaned_data/real_estate_value.csv')

In [26]:
quandl.get_table('WB/DATA', series_id='VC.PKP.TOTL.UN', country_code='usa')

Empty DataFrame
Columns: [series_id, country_code, country_name, year, value]
Index: []